IdeaRS.Connections
PlateSideCode Enumeration
Compatible with IDEA StatiCa 0.0
 Represents the surface of the plate
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public enum PlateSideCode
Members
Member name | Value | Description
Default | 0 |  Needed for serialization
LowerSide | 1 |  Lower side (in the oposite direction to the direction of the normal vector)
UpperSide | 2 |  Upper side (in the direction of the normal vector of the plate)
BothSides | 3 |  Both sides
Center | 4 |  Center
See Also
Reference
IdeaRS.Connections.Data Namespace